rpmbuild/fedora-packagers-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-05 五 06:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fedora Packages Guide</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="buxoman" />
</head>
<body>
<div id="content">
<h1 class="title">Fedora Packages Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26a3deb">1. Packagers Guide</a>
<ul>
<li><a href="#org16e7b9a">1.1. 1.2. Package Design</a>
<ul>
<li><a href="#orga113c31">1.1.1. 1.2.1. Package File Name</a></li>
<li><a href="#org5383bb4">1.1.2. 1.2.2. Format of the Archived Files</a></li>
<li><a href="#orga6133a5">1.1.3. 1.2.3. Querying Packages</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org26a3deb" class="outline-2">
<h2 id="org26a3deb"><span class="section-number-2">1</span> Packagers Guide</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org16e7b9a" class="outline-3">
<h3 id="org16e7b9a"><span class="section-number-3">1.1</span> 1.2. Package Design</h3>
<div class="outline-text-3" id="text-1-1">
<p>
As a part of their design, RPM packages consist of the following three parts:
</p>

<dl class="org-dl">
<dt>Metadata</dt><dd>The metadata part defines the package itself, including
its name, version, license, a list of changes,
dependencies, and so on.</dd>
<dt>Files</dt><dd>This part consists of an archive with files that are
installed by the package on the system.</dd>
<dt>Scripts</dt><dd><p>
	     This part contains scripts, which are run when the
package is installed, updated, or uninstalled.
</p>

<p>
Each of these three parts must be defined, provided, or included by the package in order to successfully build, install, or uninstall the package.
</p></dd>
</dl>
</div>

<div id="outline-container-orga113c31" class="outline-4">
<h4 id="orga113c31"><span class="section-number-4">1.1.1</span> 1.2.1. Package File Name</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Every package file is labeled with a highly identifiable name. This
name has four parts, which typically look something like:
</p>

<pre class="example">
kernel-smp-2.6.32.9-3.i686.rpm
kernel-smp-2.6.32.9-3.x86_64.rpm
rootfiles-7.2-1.noarch.rpm 

</pre>

<p>
Here, the four parts of each name are separated from each other by
dashes or periods. The structure of the package file name is as
follows:
</p>

<pre class="example">
name-version-release.architecture.rpm 

</pre>
</div>

<ul class="org-ul">
<li><a id="orgdac17a0"></a>1.2.1.1. Package Architecture<br />
<div class="outline-text-5" id="text-orgdac17a0">
<p>
RPM supports various architectures. The following table presents some
of the architectures available for different platforms that are
supported by Fedora 18.
</p>

<table id="org71d7c6d" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Table 1.1. Package Architecture</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Platform</th>
<th scope="col" class="org-left">Architecture</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Intel x86 or compatible</td>
<td class="org-left">i386, i686</td>
</tr>

<tr>
<td class="org-left">AMD64 / Intel 64</td>
<td class="org-left">x86<sub>64</sub></td>
</tr>

<tr>
<td class="org-left">Intel Itanium</td>
<td class="org-left">ia64</td>
</tr>

<tr>
<td class="org-left">IBM POWER</td>
<td class="org-left">ppc64</td>
</tr>

<tr>
<td class="org-left">IBM System z</td>
<td class="org-left">s390x, s390</td>
</tr>

<tr>
<td class="org-left">No architecture</td>
<td class="org-left">noarch</td>
</tr>
</tbody>
</table>

<p>
A platform-independent package, which is identified with <b>noarch</b> in the
architecture part of the file name, provides programs that are not
dependent on any platform. Programs written in Perl, Python, or other
scripting languages often do not depend on code compiled for a
particular architecture. In addition, compiled Java applications are
usually free of platform dependencies, thus are also distributed in
the form of platform-independent packages.
</p>
</div>
</li>

<li><a id="org82fd917"></a>1.2.1.2. Source RPM<br />
<div class="outline-text-5" id="text-org82fd917">
<p>
A source RPM package (SRPM) contain all the commands, usually in
scripts, necessary to recreate the binary RPM. Having a SRPM means
that you can recreate the binary RPM at any time. A SRPM has a file
name ending in .src.rpm, for example:
</p>

<pre class="example">
mlocate-0.22.2-2.src.rpm 

</pre>

<p>
The SRPM distributes a source code for the corresponding software that is ready to be installed on the system with the binary RPM. It also includes a spec file, which describes the software and the package, and contains instructions on how to perform the installation on the system. 
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5383bb4" class="outline-4">
<h4 id="org5383bb4"><span class="section-number-4">1.1.2</span> 1.2.2. Format of the Archived Files</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The archive with files, which are installed by the package, is stored
in the cpio format inside the package and is compressed with the xz
program.
</p>

<p>
To decompress the included archive and extract the archived files, run
the command in the following format:
</p>

<pre class="example">
rpm2cpio package | cpio -id 

</pre>

<p>
For example, to decompress the archive included in the eject-2.1.5-0.1.fc18.x86<sub>64.rpm</sub> package, run the following command:
</p>

<pre class="example">
rpm2cpio eject-2.1.5-0.1.fc18.x86_64.rpm | cpio -id 

</pre>
</div>
</div>

<div id="outline-container-orga6133a5" class="outline-4">
<h4 id="orga6133a5"><span class="section-number-4">1.1.3</span> 1.2.3. Querying Packages</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
The rpm allows you to query packages that are available on the system. This way, you can easily explore the basic structure of the packages.
</p>

<p>
Some of the useful commands for querying the packages include:
</p>

<dl class="org-dl">
<dt>*rpm -qd <i>package</i> *</dt><dd>rpm -qd package command is used to get a list of included
documentation files, which are defined by the <b>%doc</b> directive.</dd>

<dt>*rpm -qc <i>package</i> *</dt><dd>The rpm -qc package command is used to get a list of included
configuration files, which are defined by the <b>%config</b> directive.</dd>

<dt>*rpm -q &#x2013;scripts <i>package</i> *</dt><dd>The rpm -q &#x2013;scripts package command is used to get a list of
scripts, which are defined by the <b>%pre, %post, %preun</b>, and
<b>%postun</b> directives.</dd>
</dl>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: buxoman</p>
<p class="date">Created: 2018-01-05 五 06:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
